# St7GetNumModesInModalFile

Returns the number of modes found in the modal superposition file.

long St7GetNumModesInModalFile(long uID, long* NumModes)

Input Parameters

uID

Strand7 model file ID.

Output Parameters
NumModes

Number of modes in file.

Strand7 API Manual

Applicability

Applicable to harmonic response analysis and linear transient dynamic analysis with mode superposition.